tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "remotemobprogramming/brew"
brew "exa"
brew "gawk"
brew "git"
brew "graphviz"
brew "krb5"
brew "libpq"
brew "neovim"
brew "postgresql@14", restart_service: true
brew "scdoc"
brew "starship"
brew "tmux"
brew "tree"
brew "daipeihust/tap/im-select"
brew "remotemobprogramming/brew/mob"
cask "alacritty"
cask "alt-tab"
cask "font-hack-nerd-font"
cask "keycastr"
cask "sequel-ace"
cask "temurin"
vscode "2gua.rainbow-brackets"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dariofuzinato.vue-peek"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "hollowtree.vue-snippets"
vscode "jebbs.plantuml"
vscode "JoeBerria.statusbarerror"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "PulkitGangwar.nextjs-snippets"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "WakaTime.vscode-wakatime"
vscode "xabikos.JavaScriptSnippets"
